linux-note.org
#+TITLE: linux命令杂记
#+OPTIONS: toc:t num:t

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./myorg.css"/>

#+begin_src 
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+end_src

* du -h 以可读形式显示文件大小 

#+begin_src sh
$ du -h linux-note.org 

12K	linux-note.org
#+end_src

** 查看目录下的大文件
#+begin_src 
du -sh .* * | grep G
#+end_src



* test命令

#+begin_src sh
test `命令` = 'str' 
test `命令` = 'string' -a `命令` = 'string'
test `命令` = "string" -o `命令` = 'string'
#+end_src

E.g
#+begin_src sh
  # 判断当前平台是否是linux
  test `uname -s` = 'Linux'
  echo $? # 返回零表示无错误发生 
#+end_src



* bash脚本的编写

** ~set -e~ 遇到错误就停止
bash脚本默认行为是忽略错误,继续运行.
在脚本开头设置set -e就会使得: 只要有命令返回值!=0整个脚本的运行就会终止

* pstree 查看进程树

~pstree -ap | grep mysql/redis ...~

在emacs中的shell运行pstree.
#+begin_src
sun@Salted-PC:saltedf.github.io [main] $ pstree -ap | grep emacs

  |           `-emacs,65 -nw .
  |               |   |-grep,217 --color=auto emacs
  |               `-{emacs},66

#+end_src


* strace 追踪程序的系统调用
用于debug和理解程序的流程.

#+begin_src bash
strace -f -s 65535 -i -t -T  -p <pid>    -o 输出文件 
#+end_src

有时候会输出大量信息, 根本无法分析, 若只是需要特定的系统调用,可以使用 ~-e trace=~ 进行过滤, 如:负责读取/接收这类的系统调用.
 
~-e trace=recvfrom,read,recv,recvmsg~

#+begin_src 
strace -f -s 65535 -i -t -T -e trace=write,sendto,send  -p <PID> 
#+end_src


统计各个系统调用总耗时:

#+begin_src bash
strace -c <程序>

strace -c -p <PID>
#+end_src

结果显示了各个系统调用所花费总时间以及所占百分比, 调用次数, 以及出错次数. 出错越多一般代码质量越差.
#+begin_src bash

% time     seconds  usecs/call     calls    errors syscall
------ ----------- ----------- --------- --------- ----------------
 49.27    0.009506           7      1281           clock_gettime
 18.75    0.003617           9       390           rt_sigprocmask
  9.05    0.001747           9       175           ioctl
  8.12    0.001567          17        92           write
  5.40    0.001042          23        45           pselect6
  2.48    0.000478          28        17           fcntl
  2.38    0.000459          13        35           rt_sigreturn
  1.37    0.000265           6        38           read
  1.37    0.000264           7        35           timerfd_settime
  1.29    0.000249          27         9           poll
  0.37    0.000071          35         2           kill
  0.16    0.000030          15         2           getpid
  0.00    0.000000           0         2           close
  0.00    0.000000           0         2           openat
------ ----------- ----------- --------- --------- ----------------
100.00    0.019295                  2125           total

#+end_src


代码分析组合拳: strace看关键调用. ==> 用calltree找出关键系统调用的调用关系. ==>用IDE细看这条调用链 


* objdump -D 显示可执行文件/库文件的反汇编

objdump -D XXX | less 
不加less会显示太多!


* ldd 显示链接信息

#+begin_src sh
$ ldd ./build/udpclient 

	linux-vdso.so.1 (0x00007ffcb2d85000)
	libstdc++.so.6 => /lib/x86_64-linux-gnu/libstdc++.so.6 (0x00007f4c64e2a000)
	libgcc_s.so.1 => /lib/x86_64-linux-gnu/libgcc_s.so.1 (0x00007f4c64e0f000)
	libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007f4c64c1d000)
	libm.so.6 => /lib/x86_64-linux-gnu/libm.so.6 (0x00007f4c64ace000)
	/lib64/ld-linux-x86-64.so.2 (0x00007f4c65024000)
#+end_src


* wget 保存整个网站

https://github.com/lujun9972/linux-document/blob/master/examples/10%20wget%20command%20examples.org

#+begin_src 
wget --mirror --convert-links --page-requisites ----no-parent -P /path/to/download https://example-domain.com
#+end_src

但这样可能会下载不全，原因可能有很多。这里遇到的问题是默认是不跨域名下载的。


需要运行第二次，并附加上多个选项 

#+begin_src 
wget --mirror --convert-links -r -D "www.seas.upenn.edu,www.cis.upenn.edu"  -A.pdf -A.zip -A.shtml --tries=1 --timeout=8  --span-hosts  -l 5  --page-requisites --no-parent -P ./  https://www.seas.upenn.edu/\~cis341/17sp/  
#+end_src


+ -A 指定那些没有被下载的文件类型 （需要观察网站特征获知）

+ --span-hosts 跨主机名下载。
  
+ -D 指定域名/主机名 list，否则将遍历大量无用的域名（需要观察网站特征获知）

+ --tries=1 重试一次，因为有些域名无法访问，也不含要下载的文件。

+ --timeout=10 设定超时时间，防止等待太长时间。



* 配置apt软件源


#+begin_src bash
sudo vim /etc/apt/source.list

sudo apt-get update
#+end_src





