linux-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-05 四 15:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux命令杂记</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./myorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">linux命令杂记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5dc90e1">1. du -h 以可读形式显示文件大小</a>
<ul>
<li><a href="#orgf3e7021">1.1. 查看目录下的大文件</a></li>
</ul>
</li>
<li><a href="#org79ded4e">2. test命令</a></li>
<li><a href="#org4c6d1d3">3. bash脚本的编写</a>
<ul>
<li><a href="#org5b9343a">3.1. <code>set -e</code> 遇到错误就停止</a></li>
</ul>
</li>
<li><a href="#orga7b20e0">4. pstree 查看进程树</a></li>
<li><a href="#org641ed13">5. strace 追踪程序的系统调用</a></li>
<li><a href="#orgae5be07">6. objdump -D 显示可执行文件/库文件的反汇编</a></li>
<li><a href="#org7269478">7. ldd 显示链接信息</a></li>
<li><a href="#orgbc397ab">8. wget 保存整个网站</a></li>
<li><a href="#org3e1ba0c">9. 配置apt软件源</a></li>
<li><a href="#org5a67252">10. 重启ssh服务</a></li>
<li><a href="#org2e10656">11. 查看ssh服务是否启动</a></li>
<li><a href="#orga493e6e">12. 递归改变文件owner</a></li>
<li><a href="#orge30f076">13. 汇编文件(.s)的结构</a></li>
<li><a href="#orgedaebdf">14. makefile</a>
<ul>
<li><a href="#org8fe0ccf">14.1. 定义变量</a></li>
<li><a href="#orga74c1a7">14.2. 伪目标 .PHONY</a></li>
<li><a href="#orga7d69cb">14.3. 为整个项目添加宏定义</a></li>
<li><a href="#orgc7f381f">14.4. 为目标链接上库</a></li>
<li><a href="#org1fceb56">14.5. 通配符</a></li>
<li><a href="#orge02e800">14.6. 函数调用</a>
<ul>
<li><a href="#orgc258163">14.6.1. 当前目录下某一类型的所有文件形成的列表</a></li>
<li><a href="#org2b89deb">14.6.2. 将列表中的所有匹配项替换为指定形式</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge63483e">15. GDB</a>
<ul>
<li><a href="#org3cacdd4">15.1. 为可执行文件设置环境变量</a></li>
<li><a href="#org9fae687">15.2. 为可执行程序传参</a></li>
<li><a href="#org11e5e6e">15.3. 显示某文件源代码</a></li>
<li><a href="#org2ac9616">15.4. 添加断点</a></li>
<li><a href="#org1cadd3d">15.5. 查看断点</a></li>
<li><a href="#org10086e4">15.6. 禁用断点</a></li>
<li><a href="#orgfde5ea3">15.7. 重新启用断点</a></li>
<li><a href="#org1f7419d">15.8. 删除断点</a></li>
<li><a href="#orgad9e87e">15.9. 保存断点到文件</a></li>
<li><a href="#orgc7d543f">15.10. 单步跳过 next</a></li>
<li><a href="#org950af82">15.11. 继续执行, 直至遇到断点</a></li>
<li><a href="#orgcbd0938">15.12. 运行到某处,忽略期间的断点</a></li>
<li><a href="#orgb50a32b">15.13. 进入到函数内部</a></li>
<li><a href="#orgd820ffb">15.14. 从函数中跳出并暂停</a></li>
<li><a href="#orgf873b80">15.15. 强制从函数中返回特定值</a></li>
<li><a href="#orga26b99e">15.16. 跳转到指定位置继续执行</a></li>
<li><a href="#org4e859ef">15.17. 显示当前所有的局部变量</a></li>
<li><a href="#org807e47a">15.18. 变量/表达式相关</a>
<ul>
<li><a href="#org7945d26">15.18.1. 打印变量/表达式</a></li>
<li><a href="#org3cb203a">15.18.2. 自动显示变量值</a></li>
<li><a href="#org3afdcef">15.18.3. 取消对变量的自动显示</a></li>
<li><a href="#org8953187">15.18.4. 显示变量/表达式类型</a></li>
<li><a href="#org02c57f4">15.18.5. 修改变量的值</a></li>
<li><a href="#org17f7cdc">15.18.6. 监视某变量的值</a></li>
</ul>
</li>
<li><a href="#org24a09da">15.19. 栈相关</a>
<ul>
<li><a href="#org185894e">15.19.1. 显示堆栈信息: bt</a></li>
<li><a href="#org737380f">15.19.2. 切换栈帧</a></li>
</ul>
</li>
<li><a href="#orgb7c0e55">15.20. 调试已经运行的程序</a></li>
<li><a href="#org009b054">15.21. 检查点</a>
<ul>
<li><a href="#orgfc75175">15.21.1. 在当前位置添加checkpoint</a></li>
<li><a href="#orge20295d">15.21.2. 查看所有checkpoints</a></li>
<li><a href="#orgada81ba">15.21.3. 删除指定checkpoint</a></li>
</ul>
</li>
<li><a href="#orgd6a509f">15.22. 线程</a>
<ul>
<li><a href="#org1537e33">15.22.1. 显示所有线程</a></li>
<li><a href="#org4143614">15.22.2. 切换到指定线程</a></li>
</ul>
</li>
<li><a href="#orgebe1d61">15.23. 以指定格式显示某地址处的内容</a></li>
<li><a href="#org8e00506">15.24. 反向运行</a></li>
</ul>
</li>
<li><a href="#org69320d4">16. CMake</a></li>
</ul>
</div>
</div>
<pre class="example">
#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/&gt;
</pre>

<div id="outline-container-org5dc90e1" class="outline-2">
<h2 id="org5dc90e1"><span class="section-number-2">1.</span> du -h 以可读形式显示文件大小</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">$ du -h linux-note.org 

12K     linux-note.org
</pre>
</div>
</div>

<div id="outline-container-orgf3e7021" class="outline-3">
<h3 id="orgf3e7021"><span class="section-number-3">1.1.</span> 查看目录下的大文件</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
du -sh .* * | grep G
</pre>
</div>
</div>
</div>



<div id="outline-container-org79ded4e" class="outline-2">
<h2 id="org79ded4e"><span class="section-number-2">2.</span> test命令</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">test <span style="color: #C57BDB; font-weight: bold;">`&#21629;&#20196;`</span> = <span style="color: #7bc275;">'str'</span> 
test <span style="color: #C57BDB; font-weight: bold;">`&#21629;&#20196;`</span> = <span style="color: #7bc275;">'string'</span> -a <span style="color: #C57BDB; font-weight: bold;">`&#21629;&#20196;`</span> = <span style="color: #7bc275;">'string'</span>
test <span style="color: #C57BDB; font-weight: bold;">`&#21629;&#20196;`</span> = <span style="color: #7bc275;">"string"</span> -o <span style="color: #C57BDB; font-weight: bold;">`&#21629;&#20196;`</span> = <span style="color: #7bc275;">'string'</span>
</pre>
</div>

<p>
E.g
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #62686E;"># </span><span style="color: #62686E;">&#21028;&#26029;&#24403;&#21069;&#24179;&#21488;&#26159;&#21542;&#26159;linux</span>
test <span style="color: #C57BDB; font-weight: bold;">`uname -s`</span> = <span style="color: #7bc275;">'Linux'</span>
<span style="color: #C57BDB;">echo</span> $<span style="color: #DFDFDF;">?</span> <span style="color: #62686E;"># </span><span style="color: #62686E;">&#36820;&#22238;&#38646;&#34920;&#31034;&#26080;&#38169;&#35823;&#21457;&#29983; </span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org4c6d1d3" class="outline-2">
<h2 id="org4c6d1d3"><span class="section-number-2">3.</span> bash脚本的编写</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5b9343a" class="outline-3">
<h3 id="org5b9343a"><span class="section-number-3">3.1.</span> <code>set -e</code> 遇到错误就停止</h3>
<div class="outline-text-3" id="text-3-1">
<p>
bash脚本默认行为是忽略错误,继续运行.
在脚本开头设置set -e就会使得: 只要有命令返回值!=0整个脚本的运行就会终止
</p>
</div>
</div>
</div>

<div id="outline-container-orga7b20e0" class="outline-2">
<h2 id="orga7b20e0"><span class="section-number-2">4.</span> pstree 查看进程树</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>pstree -ap | grep mysql/redis ...</code>
</p>

<p>
在emacs中的shell运行pstree.
</p>
<pre class="example">
sun@Salted-PC:saltedf.github.io [main] $ pstree -ap | grep emacs

  |           `-emacs,65 -nw .
  |               |   |-grep,217 --color=auto emacs
  |               `-{emacs},66

</pre>
</div>
</div>


<div id="outline-container-org641ed13" class="outline-2">
<h2 id="org641ed13"><span class="section-number-2">5.</span> strace 追踪程序的系统调用</h2>
<div class="outline-text-2" id="text-5">
<p>
用于debug和理解程序的流程.
</p>

<div class="org-src-container">
<pre class="src src-bash">strace -f -s 65535 -i -t -T  -p &lt;pid&gt;    -o &#36755;&#20986;&#25991;&#20214; 
</pre>
</div>

<p>
有时候会输出大量信息, 根本无法分析, 若只是需要特定的系统调用,可以使用 <code>-e trace=</code> 进行过滤, 如:负责读取/接收这类的系统调用.
</p>

<p>
<code>-e trace=recvfrom,read,recv,recvmsg</code>
</p>

<pre class="example">
strace -f -s 65535 -i -t -T -e trace=write,sendto,send  -p &lt;PID&gt; 
</pre>


<p>
统计各个系统调用总耗时:
</p>

<div class="org-src-container">
<pre class="src src-bash">strace -c &lt;&#31243;&#24207;&gt;

strace -c -p &lt;PID&gt;
</pre>
</div>

<p>
结果显示了各个系统调用所花费总时间以及所占百分比, 调用次数, 以及出错次数. 出错越多一般代码质量越差.
</p>
<div class="org-src-container">
<pre class="src src-bash">
% time     seconds  usecs/call     calls    errors syscall
------ ----------- ----------- --------- --------- ----------------
 49.27    0.009506           7      1281           clock_gettime
 18.75    0.003617           9       390           rt_sigprocmask
  9.05    0.001747           9       175           ioctl
  8.12    0.001567          17        92           write
  5.40    0.001042          23        45           pselect6
  2.48    0.000478          28        17           fcntl
  2.38    0.000459          13        35           rt_sigreturn
  1.37    0.000265           6        38           read
  1.37    0.000264           7        35           timerfd_settime
  1.29    0.000249          27         9           poll
  0.37    0.000071          35         2           kill
  0.16    0.000030          15         2           getpid
  0.00    0.000000           0         2           close
  0.00    0.000000           0         2           openat
------ ----------- ----------- --------- --------- ----------------
100.00    0.019295                  2125           total

</pre>
</div>


<p>
代码分析组合拳: strace看关键调用. ==&gt; 用calltree找出关键系统调用的调用关系. ==&gt;用IDE细看这条调用链 
</p>
</div>
</div>


<div id="outline-container-orgae5be07" class="outline-2">
<h2 id="orgae5be07"><span class="section-number-2">6.</span> objdump -D 显示可执行文件/库文件的反汇编</h2>
<div class="outline-text-2" id="text-6">
<p>
objdump -D XXX | less 
不加less会显示太多!
</p>
</div>
</div>


<div id="outline-container-org7269478" class="outline-2">
<h2 id="org7269478"><span class="section-number-2">7.</span> ldd 显示链接信息</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sh">$ ldd ./build/udpclient 

        linux-vdso.so.1 (0x00007ffcb2d85000)
        libstdc++.so.6 =&gt; /lib/x86_64-linux-gnu/libstdc++.so.6 (0x00007f4c64e2a000)
        libgcc_s.so.1 =&gt; /lib/x86_64-linux-gnu/libgcc_s.so.1 (0x00007f4c64e0f000)
        libc.so.6 =&gt; /lib/x86_64-linux-gnu/libc.so.6 (0x00007f4c64c1d000)
        libm.so.6 =&gt; /lib/x86_64-linux-gnu/libm.so.6 (0x00007f4c64ace000)
        /lib64/ld-linux-x86-64.so.2 (0x00007f4c65024000)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbc397ab" class="outline-2">
<h2 id="orgbc397ab"><span class="section-number-2">8.</span> wget 保存整个网站</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://github.com/lujun9972/linux-document/blob/master/examples/10%20wget%20command%20examples.org">https://github.com/lujun9972/linux-document/blob/master/examples/10%20wget%20command%20examples.org</a>
</p>

<pre class="example">
wget --mirror --convert-links --page-requisites ----no-parent -P /path/to/download https://example-domain.com
</pre>

<p>
但这样可能会下载不全，原因可能有很多。这里遇到的问题是默认是不跨域名下载的。
</p>


<p>
需要运行第二次，并附加上多个选项 
</p>

<pre class="example">
wget --mirror --convert-links -r -D "www.seas.upenn.edu,www.cis.upenn.edu"  -A.pdf -A.zip -A.shtml --tries=1 --timeout=8  --span-hosts  -l 5  --page-requisites --no-parent -P ./  https://www.seas.upenn.edu/\~cis341/17sp/  
</pre>


<ul class="org-ul">
<li>-A 指定那些没有被下载的文件类型 （需要观察网站特征获知）</li>

<li>&#x2013;span-hosts 跨主机名下载。</li>

<li>-D 指定域名/主机名 list，否则将遍历大量无用的域名（需要观察网站特征获知）</li>

<li>&#x2013;tries=1 重试一次，因为有些域名无法访问，也不含要下载的文件。</li>

<li>&#x2013;timeout=10 设定超时时间，防止等待太长时间。</li>
</ul>
</div>
</div>



<div id="outline-container-org3e1ba0c" class="outline-2">
<h2 id="org3e1ba0c"><span class="section-number-2">9.</span> 配置apt软件源</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-bash">sudo vim /etc/apt/source.list

sudo apt-get update
</pre>
</div>
</div>
</div>
