linux-note.org
* 重启ssh服务



#+begin_src bash
sudo service ssh restart
#+end_src






* 查看ssh服务是否启动

#+begin_src bash
sudo lsof -i :22 
#+end_src





* 递归改变文件owner 

#+begin_src bash
chown -R sun:sun ./dir
#+end_src




* 汇编文件(.s)的结构

#+begin_src 
.text: 代码段
.data: 常量 字符串 初始化的全局变量
.bss: 不占用实际空间, 仅仅标记那些局部变量和未初始化的全局变量.
#+end_src


因为已知初值的且生命周期长的变量才有提前为它们分配空间的必要,因此data段才占用空间. bss段中记录的是局部变量/未初始化的全局变量, 没必要一开始就为这些量准备好空间, 只要在程序实际运行时为其准备空间即可. 







* makefile
** 定义变量


#+begin_src makefile
CC := gcc # 定义常量, 后续不能用+=
OBJS = hello.o world.o # 定义变量, 后续可以用+=增加
ObJS += fuck.o  
#+end_src





** 伪目标 .PHONY

通常是指那些不生成文件的. 只负责执行某些命令的.


#+begin_src makefile
.PHONY: clean  # 这个之后的target都是伪目标

clean: 
	-${RM} *.o ${target}
	echo "finish"

#+end_src






** 为整个项目添加宏定义

#+begin_src makefile

DEFS = -D_DEBUG -D_POSIX_SOURCE

FLAGS = -g ${DEFS}

#+end_src






** 为目标链接上库



#+begin_src makefile
LIBS = -lpthread -lqt

#+end_src






** 通配符

#+begin_src bash 
 * 所有
 % :任意一个文件
 ? :
#+end_src




#+begin_src bash
$@ 目标
$^ 全部的依赖文件
$< 首个依赖项 
#+end_src





#+begin_src makefile
${target} : ${OBJS}
	${CC} ${FLAGS} -o $@ $^ ${LIBS}


%.o : %.c
	${CC} -o $@  $^ 
#+end_src







** 函数调用



#+begin_src makefile
$(my_func arg1,arg2,arg3)
#+end_src



*** 当前目录下某一类型的所有文件形成的列表

#+begin_src makefile
SRC = $(wildcard *.c)  ==> hello.c world.c fuck.c  
#+end_src





*** 将列表中的所有匹配项替换为指定形式

#+begin_src makefile
OBJS = $(patsubset %.c,%.o,${SRC} ) 

# 将 SRC = hello.c fuck.c 替换成 hello.o fuck.o 
#+end_src








* GDB

gef/cgdb/emacs gdb-many-windows

** 为可执行文件设置环境变量
set environment FOO = XX 
unset environment FOO

** 为可执行程序传参

+ 进入gdb shell后: 

~run arg1 arg2 ...~

~set args arg1 arg2 arg3~

+ 启动gdb时通过命令行传参:

~gdb ./main --args ./main a1 a2 a3 ...~

这种方式需要额外再写一次可执行文件的路径.




** 显示某文件源代码

 #+begin_src bash
 l / list <函数> 
 #+end_src

 默认显示10行


 当有多个文件时, 为了显示其中一个文件要在文件名后加 ~:N~ , 否则会被视作函数名. 
 #+begin_src
 list myfile.cc:1
 #+end_src



** 添加断点

 用break可以添加断点, 既能在指定行上添加, 也能为指定函数添加断点.(经常用在一行中有多个函数时)

 #+begin_src gdb
 break myfile.cc:100
 =====================
 break myfunc
 #+end_src

** 查看断点
显示了断点是否被禁用, 以及断点打在何处. 每个断点都有一个ID, 对断点的操作都基于此ID
#+begin_src 

(gdb) info breakpoints
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10
#+end_src

** 禁用断点

#+begin_src gdb
(gdb) disable breakpoints 4 
(gdb) i b
Num     Type           Disp Enb Address            What
4       breakpoint     keep n   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10

#+end_src

** 重新启用断点
#+begin_src 
(gdb) enable 4
(gdb) i b 
Num     Type           Disp Enb Address            What
4       breakpoint     keep y   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10
#+end_src

** 删除断点
用断点序号指定要删除的断点
#+begin_src gdb
(gdb) delete breakpoints 1
#+end_src


** 保存断点到文件
这个功能本身很简陋, 使用前提是源代码不能修改过.
save breakpoints myfile

恢复断点:
source <myfile>




** 单步跳过 next
不会进入函数内部.

** 继续执行, 直至遇到断点 
continue

** 运行到某处,忽略期间的断点

until <N行> 运行下面N行, 忽略之间的断点.

** 进入到函数内部
step

** 从函数中跳出并暂停
finish



** 强制从函数中返回特定值
return 
相当于一种特殊的jump, 并不会将函数体执行完.并指定一个返回值
** 跳转到指定位置继续执行
jump linenum 

跳转后不会自动暂停, 需要断点.

** 显示当前所有的局部变量
info loacls
** 变量/表达式相关

