linux-note.html





<div id="outline-container-org5a67252" class="outline-2">
<h2 id="org5a67252"><span class="section-number-2">10.</span> 重启ssh服务</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-bash">sudo service ssh restart
</pre>
</div>
</div>
</div>






<div id="outline-container-org2e10656" class="outline-2">
<h2 id="org2e10656"><span class="section-number-2">11.</span> 查看ssh服务是否启动</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-bash">sudo lsof -i :22 
</pre>
</div>
</div>
</div>





<div id="outline-container-orga493e6e" class="outline-2">
<h2 id="orga493e6e"><span class="section-number-2">12.</span> 递归改变文件owner</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-bash">chown -R sun:sun ./dir
</pre>
</div>
</div>
</div>




<div id="outline-container-orge30f076" class="outline-2">
<h2 id="orge30f076"><span class="section-number-2">13.</span> 汇编文件(.s)的结构</h2>
<div class="outline-text-2" id="text-13">
<pre class="example">
.text: 代码段
.data: 常量 字符串 初始化的全局变量
.bss: 不占用实际空间, 仅仅标记那些局部变量和未初始化的全局变量.
</pre>


<p>
因为已知初值的且生命周期长的变量才有提前为它们分配空间的必要,因此data段才占用空间. bss段中记录的是局部变量/未初始化的全局变量, 没必要一开始就为这些量准备好空间, 只要在程序实际运行时为其准备空间即可. 
</p>
</div>
</div>







<div id="outline-container-orgedaebdf" class="outline-2">
<h2 id="orgedaebdf"><span class="section-number-2">14.</span> makefile</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org8fe0ccf" class="outline-3">
<h3 id="org8fe0ccf"><span class="section-number-3">14.1.</span> 定义变量</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #DFDFDF;">CC</span> := gcc <span style="color: #62686E;"># </span><span style="color: #62686E;">&#23450;&#20041;&#24120;&#37327;, &#21518;&#32493;&#19981;&#33021;&#29992;+=</span>
<span style="color: #DFDFDF;">OBJS</span> = hello.o world.o <span style="color: #62686E;"># </span><span style="color: #62686E;">&#23450;&#20041;&#21464;&#37327;, &#21518;&#32493;&#21487;&#20197;&#29992;+=&#22686;&#21152;</span>
<span style="color: #DFDFDF;">ObJS</span> += fuck.o  
</pre>
</div>
</div>
</div>





<div id="outline-container-orga74c1a7" class="outline-3">
<h3 id="orga74c1a7"><span class="section-number-3">14.2.</span> 伪目标 .PHONY</h3>
<div class="outline-text-3" id="text-14-2">
<p>
通常是指那些不生成文件的. 只负责执行某些命令的.
</p>


<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #51afef;">.PHONY</span>: clean  <span style="color: #62686E;"># </span><span style="color: #62686E;">&#36825;&#20010;&#20043;&#21518;&#30340;target&#37117;&#26159;&#20266;&#30446;&#26631;</span>

<span style="color: #51afef;">clean</span>: 
        <span style="color: #FCCE7B;">-</span>${<span style="color: #DFDFDF;">RM</span>} *.o ${<span style="color: #DFDFDF;">target</span>}
        echo <span style="color: #7bc275;">"finish"</span>

</pre>
</div>
</div>
</div>






<div id="outline-container-orga7d69cb" class="outline-3">
<h3 id="orga7d69cb"><span class="section-number-3">14.3.</span> 为整个项目添加宏定义</h3>
<div class="outline-text-3" id="text-14-3">
<div class="org-src-container">
<pre class="src src-makefile">
<span style="color: #DFDFDF;">DEFS</span> = -D_DEBUG -D_POSIX_SOURCE

<span style="color: #DFDFDF;">FLAGS</span> = -g ${<span style="color: #DFDFDF;">DEFS</span>}

</pre>
</div>
</div>
</div>






<div id="outline-container-orgc7f381f" class="outline-3">
<h3 id="orgc7f381f"><span class="section-number-3">14.4.</span> 为目标链接上库</h3>
<div class="outline-text-3" id="text-14-4">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #DFDFDF;">LIBS</span> = -lpthread -lqt

</pre>
</div>
</div>
</div>






<div id="outline-container-org1fceb56" class="outline-3">
<h3 id="org1fceb56"><span class="section-number-3">14.5.</span> 通配符</h3>
<div class="outline-text-3" id="text-14-5">
<div class="org-src-container">
<pre class="src src-bash">* &#25152;&#26377;
% :&#20219;&#24847;&#19968;&#20010;&#25991;&#20214;
? :
</pre>
</div>




<div class="org-src-container">
<pre class="src src-bash">$<span style="color: #DFDFDF;">@</span> &#30446;&#26631;
$^ &#20840;&#37096;&#30340;&#20381;&#36182;&#25991;&#20214;
$&lt; &#39318;&#20010;&#20381;&#36182;&#39033; 
</pre>
</div>





<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #51afef;">${</span><span style="color: #51afef;">target</span><span style="color: #51afef;">}</span> : ${<span style="color: #DFDFDF;">OBJS</span>}
        ${<span style="color: #DFDFDF;">CC</span>} ${<span style="color: #DFDFDF;">FLAGS</span>} -o <span style="color: #51afef;">$</span><span style="color: #a991f1;">@</span> $<span style="color: #a991f1;">^</span> ${<span style="color: #DFDFDF;">LIBS</span>}


<span style="color: #51afef;">%.o</span> : %.c
        ${<span style="color: #DFDFDF;">CC</span>} -o <span style="color: #51afef;">$</span><span style="color: #a991f1;">@</span>  $<span style="color: #a991f1;">^</span> 
</pre>
</div>
</div>
</div>







<div id="outline-container-orge02e800" class="outline-3">
<h3 id="orge02e800"><span class="section-number-3">14.6.</span> 函数调用</h3>
<div class="outline-text-3" id="text-14-6">
<div class="org-src-container">
<pre class="src src-makefile">$(<span style="color: #DFDFDF;">my_func</span> arg1,arg2,arg3)
</pre>
</div>
</div>



<div id="outline-container-orgc258163" class="outline-4">
<h4 id="orgc258163"><span class="section-number-4">14.6.1.</span> 当前目录下某一类型的所有文件形成的列表</h4>
<div class="outline-text-4" id="text-14-6-1">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #DFDFDF;">SRC</span> = $(<span style="color: #DFDFDF;">wildcard</span> *.c)  ==&gt; hello.c world.c fuck.c  
</pre>
</div>
</div>
</div>





<div id="outline-container-org2b89deb" class="outline-4">
<h4 id="org2b89deb"><span class="section-number-4">14.6.2.</span> 将列表中的所有匹配项替换为指定形式</h4>
<div class="outline-text-4" id="text-14-6-2">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #DFDFDF;">OBJS</span> = $(<span style="color: #DFDFDF;">patsubset</span> %.c,%.o,${<span style="color: #DFDFDF;">SRC</span>} ) 

<span style="color: #62686E;"># </span><span style="color: #62686E;">&#23558; SRC = hello.c fuck.c &#26367;&#25442;&#25104; hello.o fuck.o </span>
</pre>
</div>
</div>
</div>
</div>
</div>








<div id="outline-container-orge63483e" class="outline-2">
<h2 id="orge63483e"><span class="section-number-2">15.</span> GDB</h2>
<div class="outline-text-2" id="text-15">
<p>
gef/cgdb/emacs gdb-many-windows
</p>
</div>

<div id="outline-container-org3cacdd4" class="outline-3">
<h3 id="org3cacdd4"><span class="section-number-3">15.1.</span> 为可执行文件设置环境变量</h3>
<div class="outline-text-3" id="text-15-1">
<p>
set environment FOO = XX 
unset environment FOO
</p>
</div>
</div>

<div id="outline-container-org9fae687" class="outline-3">
<h3 id="org9fae687"><span class="section-number-3">15.2.</span> 为可执行程序传参</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>进入gdb shell后:</li>
</ul>

<p>
<code>run arg1 arg2 ...</code>
</p>

<p>
<code>set args arg1 arg2 arg3</code>
</p>

<ul class="org-ul">
<li>启动gdb时通过命令行传参:</li>
</ul>

<p>
<code>gdb ./main --args ./main a1 a2 a3 ...</code>
</p>

<p>
这种方式需要额外再写一次可执行文件的路径.
</p>
</div>
</div>




<div id="outline-container-org11e5e6e" class="outline-3">
<h3 id="org11e5e6e"><span class="section-number-3">15.3.</span> 显示某文件源代码</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">
<pre class="src src-bash">l / list &lt;&#20989;&#25968;&gt; 
</pre>
</div>

<p>
默认显示10行
</p>


<p>
当有多个文件时, 为了显示其中一个文件要在文件名后加 <code>:N</code> , 否则会被视作函数名. 
</p>
<pre class="example">
list myfile.cc:1
</pre>
</div>
</div>



<div id="outline-container-org2ac9616" class="outline-3">
<h3 id="org2ac9616"><span class="section-number-3">15.4.</span> 添加断点</h3>
<div class="outline-text-3" id="text-15-4">
<p>
用break可以添加断点, 既能在指定行上添加, 也能为指定函数添加断点.(经常用在一行中有多个函数时)
</p>

<div class="org-src-container">
<pre class="src src-gdb">break myfile.cc:100
=====================
break myfunc
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cadd3d" class="outline-3">
<h3 id="org1cadd3d"><span class="section-number-3">15.5.</span> 查看断点</h3>
<div class="outline-text-3" id="text-15-5">
<p>
显示了断点是否被禁用, 以及断点打在何处. 每个断点都有一个ID, 对断点的操作都基于此ID
</p>
<pre class="example">

(gdb) info breakpoints
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10
</pre>
</div>
</div>

<div id="outline-container-org10086e4" class="outline-3">
<h3 id="org10086e4"><span class="section-number-3">15.6.</span> 禁用断点</h3>
<div class="outline-text-3" id="text-15-6">
<div class="org-src-container">
<pre class="src src-gdb">(gdb) disable breakpoints 4 
(gdb) i b
Num     Type           Disp Enb Address            What
4       breakpoint     keep n   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfde5ea3" class="outline-3">
<h3 id="orgfde5ea3"><span class="section-number-3">15.7.</span> 重新启用断点</h3>
<div class="outline-text-3" id="text-15-7">
<pre class="example">
(gdb) enable 4
(gdb) i b 
Num     Type           Disp Enb Address            What
4       breakpoint     keep y   0x0000000000408d60 in test_scanner_hello_Test::TestBody() at /home/sun/src/my_compiler/mytest/test_scanner.cc:10
</pre>
</div>
</div>

<div id="outline-container-org1f7419d" class="outline-3">
<h3 id="org1f7419d"><span class="section-number-3">15.8.</span> 删除断点</h3>
<div class="outline-text-3" id="text-15-8">
<p>
用断点序号指定要删除的断点
</p>
<div class="org-src-container">
<pre class="src src-gdb">(gdb) delete breakpoints 1
</pre>
</div>
</div>
</div>


<div id="outline-container-orgad9e87e" class="outline-3">
<h3 id="orgad9e87e"><span class="section-number-3">15.9.</span> 保存断点到文件</h3>
<div class="outline-text-3" id="text-15-9">
<p>
这个功能本身很简陋, 使用前提是源代码不能修改过.
save breakpoints myfile
</p>

<p>
恢复断点:
source &lt;myfile&gt;
</p>
</div>
</div>




<div id="outline-container-orgc7d543f" class="outline-3">
<h3 id="orgc7d543f"><span class="section-number-3">15.10.</span> 单步跳过 next</h3>
<div class="outline-text-3" id="text-15-10">
<p>
不会进入函数内部.
</p>
</div>
</div>

<div id="outline-container-org950af82" class="outline-3">
<h3 id="org950af82"><span class="section-number-3">15.11.</span> 继续执行, 直至遇到断点</h3>
<div class="outline-text-3" id="text-15-11">
<p>
continue
</p>
</div>
</div>

<div id="outline-container-orgcbd0938" class="outline-3">
<h3 id="orgcbd0938"><span class="section-number-3">15.12.</span> 运行到某处,忽略期间的断点</h3>
<div class="outline-text-3" id="text-15-12">
<p>
until &lt;N行&gt; 运行下面N行, 忽略之间的断点.
</p>
</div>
</div>

<div id="outline-container-orgb50a32b" class="outline-3">
<h3 id="orgb50a32b"><span class="section-number-3">15.13.</span> 进入到函数内部</h3>
<div class="outline-text-3" id="text-15-13">
<p>
step
</p>
</div>
</div>

<div id="outline-container-orgd820ffb" class="outline-3">
<h3 id="orgd820ffb"><span class="section-number-3">15.14.</span> 从函数中跳出并暂停</h3>
<div class="outline-text-3" id="text-15-14">
<p>
finish
</p>
</div>
</div>



<div id="outline-container-orgf873b80" class="outline-3">
<h3 id="orgf873b80"><span class="section-number-3">15.15.</span> 强制从函数中返回特定值</h3>
<div class="outline-text-3" id="text-15-15">
<p>
return 
相当于一种特殊的jump, 并不会将函数体执行完.并指定一个返回值
</p>
</div>
</div>
